# Chapter 10. Working with Ranges

In [1]:
%load_ext lab_black
%load_ext sql
%sql postgresql://sql-cookbook:sql-cookbook@0.0.0.0:5432/sql-cookbook

## 10.1 Locating a Range of Consecutive Values

In [2]:
%%sql
with v as (
    select *
    from (values (1, '01-JAN-2020'::date, '02-JAN-2020'::date),
                 (2, '02-JAN-2020'::date, '03-JAN-2020'::date),
                 (3, '03-JAN-2020'::date, '04-JAN-2020'::date),
                 (4, '04-JAN-2020'::date, '05-JAN-2020'::date),
                 (5, '06-JAN-2020'::date, '07-JAN-2020'::date),
                 (6, '16-JAN-2020'::date, '17-JAN-2020'::date),
                 (7, '17-JAN-2020'::date, '18-JAN-2020'::date),
                 (8, '18-JAN-2020'::date, '19-JAN-2020'::date),
                 (9, '19-JAN-2020'::date, '20-JAN-2020'::date),
                 (10, '21-JAN-2020'::date, '22-JAN-2020'::date),
                 (11, '26-JAN-2020'::date, '27-JAN-2020'::date),
                 (12, '27-JAN-2020'::date, '28-JAN-2020'::date),
                 (13, '28-JAN-2020'::date, '29-JAN-2020'::date),
                 (14, '29-JAN-2020'::date, '30-JAN-2020'::date)
         ) as t(proj_id, proj_start, proj_end)),
     projects as (
         select *, proj_end = lead(proj_start) over () as is_consecutive
         from v
     )
select proj_id, proj_start, proj_end
from projects
where is_consecutive;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
9 rows affected.

[(1, datetime.date(2020, 1, 1), datetime.date(2020, 1, 2)),
 (2, datetime.date(2020, 1, 2), datetime.date(2020, 1, 3)),
 (3, datetime.date(2020, 1, 3), datetime.date(2020, 1, 4)),
 (6, datetime.date(2020, 1, 16), datetime.date(2020, 1, 17)),
 (7, datetime.date(2020, 1, 17), datetime.date(2020, 1, 18)),
 (8, datetime.date(2020, 1, 18), datetime.date(2020, 1, 19)),
 (11, datetime.date(2020, 1, 26), datetime.date(2020, 1, 27)),
 (12, datetime.date(2020, 1, 27), datetime.date(2020, 1, 28)),
 (13, datetime.date(2020, 1, 28), datetime.date(2020, 1, 29))]

In [3]:
%%sql
with v as (
    select *
    from (values (1, '01-JAN-2020'::date, '02-JAN-2020'::date),
                 (2, '02-JAN-2020'::date, '03-JAN-2020'::date),
                 (3, '03-JAN-2020'::date, '04-JAN-2020'::date),
                 (4, '04-JAN-2020'::date, '05-JAN-2020'::date),
                 (5, '06-JAN-2020'::date, '07-JAN-2020'::date),
                 (6, '16-JAN-2020'::date, '17-JAN-2020'::date),
                 (7, '17-JAN-2020'::date, '18-JAN-2020'::date),
                 (8, '18-JAN-2020'::date, '19-JAN-2020'::date),
                 (9, '19-JAN-2020'::date, '20-JAN-2020'::date),
                 (10, '21-JAN-2020'::date, '22-JAN-2020'::date),
                 (11, '26-JAN-2020'::date, '27-JAN-2020'::date),
                 (12, '27-JAN-2020'::date, '28-JAN-2020'::date),
                 (13, '28-JAN-2020'::date, '29-JAN-2020'::date),
                 (14, '29-JAN-2020'::date, '30-JAN-2020'::date)
         ) as t(proj_id, proj_start, proj_end)),
     projects as (
         select *,
                proj_start = lag(proj_end) over () or
                proj_end = lead(proj_start) over () as is_consecutive
         from v
     )
select proj_id, proj_start, proj_end
from projects
where is_consecutive;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
12 rows affected.

[(1, datetime.date(2020, 1, 1), datetime.date(2020, 1, 2)),
 (2, datetime.date(2020, 1, 2), datetime.date(2020, 1, 3)),
 (3, datetime.date(2020, 1, 3), datetime.date(2020, 1, 4)),
 (4, datetime.date(2020, 1, 4), datetime.date(2020, 1, 5)),
 (6, datetime.date(2020, 1, 16), datetime.date(2020, 1, 17)),
 (7, datetime.date(2020, 1, 17), datetime.date(2020, 1, 18)),
 (8, datetime.date(2020, 1, 18), datetime.date(2020, 1, 19)),
 (9, datetime.date(2020, 1, 19), datetime.date(2020, 1, 20)),
 (11, datetime.date(2020, 1, 26), datetime.date(2020, 1, 27)),
 (12, datetime.date(2020, 1, 27), datetime.date(2020, 1, 28)),
 (13, datetime.date(2020, 1, 28), datetime.date(2020, 1, 29)),
 (14, datetime.date(2020, 1, 29), datetime.date(2020, 1, 30))]

## 10.2 Finding Differences Between Rows in the Same Group or Partition

In [4]:
%%sql
with emp as (
    select deptno,
           ename,
           sal,
           hiredate,
           sal - lead(sal) over (partition by deptno order by hiredate) as diff
    from emp
)
select deptno, ename, sal, hiredate, coalesce(diff::varchar, 'N/A') as diff
from emp;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
14 rows affected.

[(10, 'CLARK', 2450, datetime.date(2006, 6, 9), '-2550'),
 (10, 'KING', 5000, datetime.date(2006, 11, 17), '3700'),
 (10, 'MILLER', 1300, datetime.date(2007, 1, 23), 'N/A'),
 (20, 'SMITH', 800, datetime.date(2005, 12, 17), '-2175'),
 (20, 'JONES', 2975, datetime.date(2006, 4, 2), '-25'),
 (20, 'FORD', 3000, datetime.date(2006, 12, 3), '0'),
 (20, 'SCOTT', 3000, datetime.date(2007, 12, 9), '1900'),
 (20, 'ADAMS', 1100, datetime.date(2008, 1, 12), 'N/A'),
 (30, 'ALLEN', 1600, datetime.date(2006, 2, 20), '350'),
 (30, 'WARD', 1250, datetime.date(2006, 2, 22), '-1600'),
 (30, 'BLAKE', 2850, datetime.date(2006, 5, 1), '1350'),
 (30, 'TURNER', 1500, datetime.date(2006, 9, 8), '250'),
 (30, 'MARTIN', 1250, datetime.date(2006, 9, 28), '300'),
 (30, 'JAMES', 950, datetime.date(2006, 12, 3), 'N/A')]

## 10.3 Locating the Beginning and End of a Range of Consecutive Values

In [5]:
%%sql
with v as (select *
           from (values (1, '01-JAN-2020'::date, '02-JAN-2020'::date),
                        (2, '02-JAN-2020'::date, '03-JAN-2020'::date),
                        (3, '03-JAN-2020'::date, '04-JAN-2020'::date),
                        (4, '04-JAN-2020'::date, '05-JAN-2020'::date),
                        (5, '06-JAN-2020'::date, '07-JAN-2020'::date),
                        (6, '16-JAN-2020'::date, '17-JAN-2020'::date),
                        (7, '17-JAN-2020'::date, '18-JAN-2020'::date),
                        (8, '18-JAN-2020'::date, '19-JAN-2020'::date),
                        (9, '19-JAN-2020'::date, '20-JAN-2020'::date),
                        (10, '21-JAN-2020'::date, '22-JAN-2020'::date),
                        (11, '26-JAN-2020'::date, '27-JAN-2020'::date),
                        (12, '27-JAN-2020'::date, '28-JAN-2020'::date),
                        (13, '28-JAN-2020'::date, '29-JAN-2020'::date),
                        (14, '29-JAN-2020'::date, '30-JAN-2020'::date)
                ) as t(proj_id, proj_start, proj_end)),
     projects as (
         select *,
                case
                    when proj_start = lag(proj_end) over () then 0
                    else 1
                    end as is_new_group
         from v
     ),
     proj_groups as (
         select *, sum(is_new_group) over (order by proj_id) as proj_group
         from projects
     )
select proj_group,
       min(proj_start) as proj_start,
       max(proj_end)   as proj_end
from proj_groups
group by proj_group
order by proj_group;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
5 rows affected.

[(1, datetime.date(2020, 1, 1), datetime.date(2020, 1, 5)),
 (2, datetime.date(2020, 1, 6), datetime.date(2020, 1, 7)),
 (3, datetime.date(2020, 1, 16), datetime.date(2020, 1, 20)),
 (4, datetime.date(2020, 1, 21), datetime.date(2020, 1, 22)),
 (5, datetime.date(2020, 1, 26), datetime.date(2020, 1, 30))]

*Trade readability for debuggability:*

In [6]:
%%sql
select proj_group,
       min(proj_start) as proj_start,
       max(proj_end)   as proj_end
from (select *, sum(is_new_group) over (order by proj_id) as proj_group
      from (select *,
                   case
                       when proj_start = lag(proj_end) over () then 0
                       else 1
                       end as is_new_group
            from (select *
                  from (values (1, '01-JAN-2020'::date, '02-JAN-2020'::date),
                               (2, '02-JAN-2020'::date, '03-JAN-2020'::date),
                               (3, '03-JAN-2020'::date, '04-JAN-2020'::date),
                               (4, '04-JAN-2020'::date, '05-JAN-2020'::date),
                               (5, '06-JAN-2020'::date, '07-JAN-2020'::date),
                               (6, '16-JAN-2020'::date, '17-JAN-2020'::date),
                               (7, '17-JAN-2020'::date, '18-JAN-2020'::date),
                               (8, '18-JAN-2020'::date, '19-JAN-2020'::date),
                               (9, '19-JAN-2020'::date, '20-JAN-2020'::date),
                               (10, '21-JAN-2020'::date, '22-JAN-2020'::date),
                               (11, '26-JAN-2020'::date, '27-JAN-2020'::date),
                               (12, '27-JAN-2020'::date, '28-JAN-2020'::date),
                               (13, '28-JAN-2020'::date, '29-JAN-2020'::date),
                               (14, '29-JAN-2020'::date, '30-JAN-2020'::date)
                       ) as t(proj_id, proj_start, proj_end)
                 ) v
           ) projects
     ) proj_groups
group by proj_group
order by proj_group;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
5 rows affected.

[(1, datetime.date(2020, 1, 1), datetime.date(2020, 1, 5)),
 (2, datetime.date(2020, 1, 6), datetime.date(2020, 1, 7)),
 (3, datetime.date(2020, 1, 16), datetime.date(2020, 1, 20)),
 (4, datetime.date(2020, 1, 21), datetime.date(2020, 1, 22)),
 (5, datetime.date(2020, 1, 26), datetime.date(2020, 1, 30))]

## 10.4 Filling in Missing Values in a Range of Values

In [7]:
%%sql
with decade as (
    select (to_date('2005', 'YYYY') + (i - 1) * '1 year'::interval)::date as date
    from generate_series(1, 10) as i
)
select extract(year from date)::int as year, count(hiredate) as hires
from decade left join emp on date = date_trunc('year', hiredate)
group by date;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
10 rows affected.

[(2005, 1),
 (2006, 10),
 (2007, 2),
 (2008, 1),
 (2009, 0),
 (2010, 0),
 (2011, 0),
 (2012, 0),
 (2013, 0),
 (2014, 0)]

## 10.5 Generating Consecutive Numeric Values

In [8]:
%%sql
select generate_series(1, 7) as id

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
7 rows affected.

[(1,), (2,), (3,), (4,), (5,), (6,), (7,)]

In [9]:
%%sql
with recursive id(id) as (
    select 1
    union
    select id + 1 from id where id + 1 <= 7
)
select *
from id;

 * postgresql://sql-cookbook:***@0.0.0.0:5432/sql-cookbook
7 rows affected.

[(1,), (2,), (3,), (4,), (5,), (6,), (7,)]